alpri0265/STM32F407ZET6-MODUL-1/Src/screens.c
#include "screens.h"
#include "lcd.h"
#include "system_state.h"
#include "menu.h"
#include "encoder_menu.h"
#include "bringup_config.h"
#include "main.h"
#include "system_config.h"
#include "fault.h"
#include "axis_feedback.h"
#include "temperature.h"
#include "tool_angle.h"
#include "board.h"
#include "adc_if.h"
#include "jog.h"
#include "sl_limits.h"
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

#define MENU_LINE_PREFIX "  "
#define MENU_LINE_SEL    "> "
#define LINE_LEN         20

static bool menu_need_redraw;

/* Режим введення куту вручну на екрані Tool angle; value в десятих (0-3599), cursor 0-3 (сотні, десятки, одиниці, десяті) */
static bool tool_angle_edit_mode;
static unsigned int tool_angle_edit_value;
static unsigned int tool_angle_edit_cursor;

/* Mechanics editor state (SCREEN_MECHANICS). */
static uint8_t mech_edit_axis = 0u;   /* 0=X, 1=Z */
static uint8_t mech_edit_field = 0u;  /* 0=axis, 1=pitch, 2=steps/rev, 3=ratio */

/* Axis X/Z editor state (SCREEN_AXIS_X, SCREEN_AXIS_Z). */
static uint8_t axis_edit_field = 0u;  /* 0=max_feed, 1=min_mm, 2=max_mm */

static void render_list_screen(void)
{
    lcd_clear();
    unsigned int n = menu_get_count();
    unsigned int sel = menu_get_selected();
    /* Прокрутка: якщо пунктів > 4, показуємо вікно з 4 рядків так, щоб курсор був видно */
    unsigned int first = 0u;
    if (n > 4u) {
        first = (sel >= 3u) ? (sel - 3u) : 0u;
        if (first + 4u > n) first = n - 4u;
    }
    char buf[LINE_LEN + 4];
    for (unsigned int i = 0; i < 4u; i++) {
        unsigned int idx = first + i;
        if (idx < n) {
            const char *prefix = (idx == sel) ? MENU_LINE_SEL : MENU_LINE_PREFIX;
            const char *p = menu_get_item_text(idx);
            (void)snprintf(buf, sizeof(buf), "%s%-16s", prefix, p);
        } else
            (void)snprintf(buf, sizeof(buf), "                    ");
        buf[LINE_LEN] = '\0';
        lcd_print_line((uint8_t)i, buf);
    }
}

static void render_info_mechanics(void)
{
    axis_id_t axis = (mech_edit_axis == 0u) ? AXIS_X : AXIS_Z;
    const axis_cfg_t *ax = system_axis_cfg(axis);

    uint16_t pitch_x100 = system_mech_get_pitch_x100(axis);
    uint16_t ms = system_mech_get_microstep(axis);
    uint32_t ratio_x1000 = system_mech_get_reducer_ratio_x1000(axis);

    unsigned int pitch_mm = pitch_x100 / 100u;
    unsigned int pitch_fr = pitch_x100 % 100u;
    unsigned int ratio_i = (unsigned int)(ratio_x1000 / 1000u);
    unsigned long spmm = (unsigned long)(ax->steps_per_mm + 0.5f);

    char buf[LINE_LEN + 2];
    char tmp[64];

    /* Line 0: axis */
    (void)snprintf(tmp, sizeof(tmp), "%cMech %c", (mech_edit_field == 0u) ? '>' : ' ',
                   (axis == AXIS_X) ? 'X' : 'Z');
    (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
    buf[LINE_LEN] = '\0';
    lcd_print_line(0, buf);

    /* Line 1: pitch */
    (void)snprintf(tmp, sizeof(tmp), "%cPitch:%u.%02umm",
                   (mech_edit_field == 1u) ? '>' : ' ', pitch_mm, pitch_fr);
    (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
    buf[LINE_LEN] = '\0';
    lcd_print_line(1, buf);

    /* Line 2: steps/rev */
    (void)snprintf(tmp, sizeof(tmp), "%cMicro:%u",
                   (mech_edit_field == 2u) ? '>' : ' ', (unsigned)ms);
    (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
    buf[LINE_LEN] = '\0';
    lcd_print_line(2, buf);

    /* Line 3: integer reducer ratio (10:1 => R=10) + resulting steps/mm */
    (void)snprintf(tmp, sizeof(tmp), "%cR:%u sp:%lu",
                   (mech_edit_field == 3u) ? '>' : ' ', ratio_i, spmm);
    (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
    buf[LINE_LEN] = '\0';
    lcd_print_line(3, buf);
}

static void render_info_jog(void)
{
    float x_mm = 0.0f, z_mm = 0.0f;
    jog_get_pos_mm(&x_mm, &z_mm);
    int32_t xf = axis_feedback_pos_um(AXIS_X);
    int32_t zf = axis_feedback_pos_um(AXIS_Z);
    unsigned int ju, jd, jl, jr, rapid;
    uint32_t steps_x, steps_z;
    jog_get_joy_state(&ju, &jd, &jl, &jr);
    jog_get_step_counts(&steps_x, &steps_z);
    jog_get_rapid_state(&rapid);
    char buf[LINE_LEN + 2];
    {
        int32_t x_abs = (xf < 0) ? -xf : xf;
        int32_t z_abs = (zf < 0) ? -zf : zf;
        char tmp[48];
        (void)snprintf(tmp, sizeof(tmp), "Xf:%c%ld.%03ld",
                       (xf < 0) ? '-' : '+', (long)(x_abs / 1000), (long)(x_abs % 1000));
        (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp); /* pad/trim to clear old chars */
        buf[LINE_LEN] = '\0';
        lcd_print_line(0, buf);

        (void)snprintf(tmp, sizeof(tmp), "Zf:%c%ld.%03ld",
                       (zf < 0) ? '-' : '+', (long)(z_abs / 1000), (long)(z_abs % 1000));
        (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
        buf[LINE_LEN] = '\0';
        lcd_print_line(1, buf);
    }
    /* Рядок 3 (індекс 2): короткі мітки, щоб влізло в 20 символів */
    (void)snprintf(buf, sizeof(buf), "X:%lu Z:%lu",
                   (unsigned long)steps_x, (unsigned long)steps_z);
    buf[LINE_LEN] = '\0';
    lcd_print_line(2, buf);
    (void)snprintf(buf, sizeof(buf), "U%u D%u L%u R%u *%u Up=Bk", ju, jd, jl, jr, rapid);
    buf[LINE_LEN] = '\0';
    lcd_print_line(3, buf);
}

static void render_info_feed_manual(void)
{
    uint16_t feed_raw = adc_if_read(ADC_CH_FEED_OVERRIDE);
    unsigned int feed_pct = 30u + ((unsigned)feed_raw * 120u) / 4095u;
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "Manual feed        ");
    (void)snprintf(buf, sizeof(buf), "Pot: %u%%           ", feed_pct);
    buf[LINE_LEN] = '\0';
    lcd_print_line(1, buf);
    lcd_print_line(2, "PA4 potentiometer  ");
    lcd_print_line(3, "[Back]             ");
}

static void render_info_feed_auto(void)
{
    float x_mm = 0.0f, z_mm = 0.0f;
    jog_get_pos_mm(&x_mm, &z_mm);
    int32_t xf = axis_feedback_pos_um(AXIS_X);
    int32_t zf = axis_feedback_pos_um(AXIS_Z);
    bool x_ok = sl_limits_x_taught();
    bool z_ok = sl_limits_z_taught();
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "Feed Auto        ");
    {
        int32_t x_abs = (xf < 0) ? -xf : xf;
        int32_t z_abs = (zf < 0) ? -zf : zf;
        char tmp[48];
        (void)snprintf(tmp, sizeof(tmp), "Xf:%c%ld.%03ld",
                       (xf < 0) ? '-' : '+', (long)(x_abs / 1000), (long)(x_abs % 1000));
        (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
        buf[LINE_LEN] = '\0';
        lcd_print_line(1, buf);

        (void)snprintf(tmp, sizeof(tmp), "Zf:%c%ld.%03ld",
                       (zf < 0) ? '-' : '+', (long)(z_abs / 1000), (long)(z_abs % 1000));
        (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
        buf[LINE_LEN] = '\0';
        lcd_print_line(2, buf);
    }
    (void)snprintf(buf, sizeof(buf), "X%c Z%c Joy SL [Bk]",
                   x_ok ? '+' : '-', z_ok ? '+' : '-');
    buf[LINE_LEN] = '\0';
    lcd_print_line(3, buf);
}

